#+STARTUP: folded indent
#+PROPERTY: header-args:R :results output :colnames yes :session *R:mlr*

* ={mlr}=
* ライブラリの読み込み
  
#+begin_src R :results silent
library(mlr)
#+end_src

* 全関数 ={mlr}=

#+begin_src R
pacman::p_funs(mlr)
#+end_src

#+RESULTS:
#+begin_example
  [1] "acc"                                   
  [2] "addRRMeasure"                          
  [3] "analyzeFeatSelResult"                  
  [4] "arsq"                                  
  [5] "asROCRPrediction"                      
  [6] "auc"                                   
  [7] "b632"                                  
  [8] "b632plus"                              
  [9] "bac"                                   
 [10] "batchmark"                             
 [11] "benchmark"                             
 [12] "ber"                                   
 [13] "bootstrapB632"                         
 [14] "bootstrapB632plus"                     
 [15] "bootstrapOOB"                          
 [16] "brier"                                 
 [17] "brier.scaled"                          
 [18] "calculateConfusionMatrix"              
 [19] "calculateROCMeasures"                  
 [20] "capLargeValues"                        
 [21] "changeData"                            
 [22] "checkLearner"                          
 [23] "checkPredictLearnerOutput"             
 [24] "cindex"                                
 [25] "cindex.uno"                            
 [26] "configureMlr"                          
 [27] "convertBMRToRankMatrix"                
 [28] "convertMLBenchObjToTask"               
 [29] "createDummyFeatures"                   
 [30] "createSpatialResamplingPlots"          
 [31] "crossval"                              
 [32] "cv10"                                  
 [33] "cv2"                                   
 [34] "cv3"                                   
 [35] "cv5"                                   
 [36] "db"                                    
 [37] "deleteCacheDir"                        
 [38] "downsample"                            
 [39] "dropFeatures"                          
 [40] "dunn"                                  
 [41] "estimateRelativeOverfitting"           
 [42] "estimateResidualVariance"              
 [43] "expvar"                                
 [44] "extractFDAFeatures"                    
 [45] "extractFDAFourier"                     
 [46] "extractFDAFPCA"                        
 [47] "extractFDAMultiResFeatures"            
 [48] "extractFDAWavelets"                    
 [49] "f1"                                    
 [50] "fdr"                                   
 [51] "featperc"                              
 [52] "filterFeatures"                        
 [53] "fixedcv"                               
 [54] "fn"                                    
 [55] "fnr"                                   
 [56] "fp"                                    
 [57] "fpr"                                   
 [58] "friedmanPostHocTestBMR"                
 [59] "friedmanTestBMR"                       
 [60] "G1"                                    
 [61] "G2"                                    
 [62] "generateCalibrationData"               
 [63] "generateCritDifferencesData"           
 [64] "generateFeatureImportanceData"         
 [65] "generateFilterValuesData"              
 [66] "generateHyperParsEffectData"           
 [67] "generateLearningCurveData"             
 [68] "generatePartialDependenceData"         
 [69] "generateThreshVsPerfData"              
 [70] "getBMRAggrPerformances"                
 [71] "getBMRFeatSelResults"                  
 [72] "getBMRFilteredFeatures"                
 [73] "getBMRLearnerIds"                      
 [74] "getBMRLearners"                        
 [75] "getBMRLearnerShortNames"               
 [76] "getBMRMeasureIds"                      
 [77] "getBMRMeasures"                        
 [78] "getBMRModels"                          
 [79] "getBMRPerformances"                    
 [80] "getBMRPredictions"                     
 [81] "getBMRTaskDescriptions"                
 [82] "getBMRTaskDescs"                       
 [83] "getBMRTaskIds"                         
 [84] "getBMRTuneResults"                     
 [85] "getCacheDir"                           
 [86] "getCaretParamSet"                      
 [87] "getClassWeightParam"                   
 [88] "getConfMatrix"                         
 [89] "getDefaultMeasure"                     
 [90] "getFailureModelDump"                   
 [91] "getFailureModelMsg"                    
 [92] "getFeatSelResult"                      
 [93] "getFeatureImportance"                  
 [94] "getFeatureImportanceLearner"           
 [95] "getFilteredFeatures"                   
 [96] "getHomogeneousEnsembleModels"          
 [97] "getHyperPars"                          
 [98] "getLearnerId"                          
 [99] "getLearnerModel"                       
[100] "getLearnerNote"                        
[101] "getLearnerPackages"                    
[102] "getLearnerParamSet"                    
[103] "getLearnerParVals"                     
[104] "getLearnerPredictType"                 
[105] "getLearnerProperties"                  
[106] "getLearnerShortName"                   
[107] "getLearnerType"                        
[108] "getMeasureProperties"                  
[109] "getMlrOptions"                         
[110] "getMultilabelBinaryPerformances"       
[111] "getNestedTuneResultsOptPathDf"         
[112] "getNestedTuneResultsX"                 
[113] "getOOBPreds"                           
[114] "getOOBPredsLearner"                    
[115] "getPredictionDump"                     
[116] "getPredictionProbabilities"            
[117] "getPredictionResponse"                 
[118] "getPredictionSE"                       
[119] "getPredictionTaskDesc"                 
[120] "getPredictionTruth"                    
[121] "getProbabilities"                      
[122] "getResamplingIndices"                  
[123] "getRRDump"                             
[124] "getRRPredictionList"                   
[125] "getRRPredictions"                      
[126] "getRRTaskDesc"                         
[127] "getRRTaskDescription"                  
[128] "getStackedBaseLearnerPredictions"      
[129] "getTaskClassLevels"                    
[130] "getTaskCosts"                          
[131] "getTaskData"                           
[132] "getTaskDesc"                           
[133] "getTaskDescription"                    
[134] "getTaskFeatureNames"                   
[135] "getTaskFormula"                        
[136] "getTaskId"                             
[137] "getTaskNFeats"                         
[138] "getTaskSize"                           
[139] "getTaskTargetNames"                    
[140] "getTaskTargets"                        
[141] "getTaskType"                           
[142] "getTuneResult"                         
[143] "getTuneResultOptPath"                  
[144] "gmean"                                 
[145] "gpr"                                   
[146] "growingcv"                             
[147] "hasFunctionalFeatures"                 
[148] "hasLearnerProperties"                  
[149] "hasMeasureProperties"                  
[150] "hasProperties"                         
[151] "helpLearner"                           
[152] "helpLearnerParam"                      
[153] "holdout"                               
[154] "hout"                                  
[155] "iauc.uno"                              
[156] "ibrier"                                
[157] "impute"                                
[158] "imputeConstant"                        
[159] "imputeHist"                            
[160] "imputeLearner"                         
[161] "imputeMax"                             
[162] "imputeMean"                            
[163] "imputeMedian"                          
[164] "imputeMin"                             
[165] "imputeMode"                            
[166] "imputeNormal"                          
[167] "imputeUniform"                         
[168] "isFailureModel"                        
[169] "joinClassLevels"                       
[170] "kappa"                                 
[171] "kendalltau"                            
[172] "learnerArgsToControl"                  
[173] "listFilterEnsembleMethods"             
[174] "listFilterMethods"                     
[175] "listLearnerProperties"                 
[176] "listLearners"                          
[177] "listMeasureProperties"                 
[178] "listMeasures"                          
[179] "listTaskTypes"                         
[180] "logloss"                               
[181] "lsr"                                   
[182] "mae"                                   
[183] "makeAggregation"                       
[184] "makeBaggingWrapper"                    
[185] "makeBaseWrapper"                       
[186] "makeChainModel"                        
[187] "makeClassificationViaRegressionWrapper"
[188] "makeClassifTask"                       
[189] "makeClassifTaskDesc"                   
[190] "makeClusterTask"                       
[191] "makeClusterTaskDesc"                   
[192] "makeConstantClassWrapper"              
[193] "makeCostMeasure"                       
[194] "makeCostSensClassifWrapper"            
[195] "makeCostSensRegrWrapper"               
[196] "makeCostSensTask"                      
[197] "makeCostSensTaskDesc"                  
[198] "makeCostSensWeightedPairsWrapper"      
[199] "makeCustomResampledMeasure"            
[200] "makeDownsampleWrapper"                 
[201] "makeDummyFeaturesWrapper"              
[202] "makeExtractFDAFeatMethod"              
[203] "makeExtractFDAFeatsWrapper"            
[204] "makeFeatSelControlExhaustive"          
[205] "makeFeatSelControlGA"                  
[206] "makeFeatSelControlRandom"              
[207] "makeFeatSelControlSequential"          
[208] "makeFeatSelWrapper"                    
[209] "makeFilter"                            
[210] "makeFilterEnsemble"                    
[211] "makeFilterWrapper"                     
[212] "makeFixedHoldoutInstance"              
[213] "makeFunctionalData"                    
[214] "makeImputeMethod"                      
[215] "makeImputeWrapper"                     
[216] "makeLearner"                           
[217] "makeLearners"                          
[218] "makeMeasure"                           
[219] "makeModelMultiplexer"                  
[220] "makeModelMultiplexerParamSet"          
[221] "makeMulticlassWrapper"                 
[222] "makeMultilabelBinaryRelevanceWrapper"  
[223] "makeMultilabelClassifierChainsWrapper" 
[224] "makeMultilabelDBRWrapper"              
[225] "makeMultilabelNestedStackingWrapper"   
[226] "makeMultilabelStackingWrapper"         
[227] "makeMultilabelTask"                    
[228] "makeMultilabelTaskDesc"                
[229] "makeOverBaggingWrapper"                
[230] "makeOversampleWrapper"                 
[231] "makePrediction"                        
[232] "makePreprocWrapper"                    
[233] "makePreprocWrapperCaret"               
[234] "makeRegrTask"                          
[235] "makeRegrTaskDesc"                      
[236] "makeRemoveConstantFeaturesWrapper"     
[237] "makeResampleDesc"                      
[238] "makeResampleInstance"                  
[239] "makeRLearner"                          
[240] "makeRLearnerClassif"                   
[241] "makeRLearnerCluster"                   
[242] "makeRLearnerCostSens"                  
[243] "makeRLearnerMultilabel"                
[244] "makeRLearnerRegr"                      
[245] "makeRLearnerSurv"                      
[246] "makeSMOTEWrapper"                      
[247] "makeStackedLearner"                    
[248] "makeSurvTask"                          
[249] "makeSurvTaskDesc"                      
[250] "makeTaskDescInternal"                  
[251] "makeTuneControlCMAES"                  
[252] "makeTuneControlDesign"                 
[253] "makeTuneControlGenSA"                  
[254] "makeTuneControlGrid"                   
[255] "makeTuneControlIrace"                  
[256] "makeTuneControlMBO"                    
[257] "makeTuneControlRandom"                 
[258] "makeTuneMultiCritControlGrid"          
[259] "makeTuneMultiCritControlMBO"           
[260] "makeTuneMultiCritControlNSGA2"         
[261] "makeTuneMultiCritControlRandom"        
[262] "makeTuneWrapper"                       
[263] "makeUndersampleWrapper"                
[264] "makeWeightedClassesWrapper"            
[265] "makeWrappedModel"                      
[266] "mape"                                  
[267] "mcc"                                   
[268] "mcp"                                   
[269] "meancosts"                             
[270] "measureACC"                            
[271] "measureAU1P"                           
[272] "measureAU1U"                           
[273] "measureAUC"                            
[274] "measureAUNP"                           
[275] "measureAUNU"                           
[276] "measureBAC"                            
[277] "measureBER"                            
[278] "measureBrier"                          
[279] "measureBrierScaled"                    
[280] "measureEXPVAR"                         
[281] "measureF1"                             
[282] "measureFDR"                            
[283] "measureFN"                             
[284] "measureFNR"                            
[285] "measureFP"                             
[286] "measureFPR"                            
[287] "measureGMEAN"                          
[288] "measureGPR"                            
[289] "measureKAPPA"                          
[290] "measureKendallTau"                     
[291] "measureLogloss"                        
[292] "measureLSR"                            
[293] "measureMAE"                            
[294] "measureMAPE"                           
[295] "measureMCC"                            
[296] "measureMEDAE"                          
[297] "measureMEDSE"                          
[298] "measureMMCE"                           
[299] "measureMSE"                            
[300] "measureMSLE"                           
[301] "measureMulticlassBrier"                
[302] "measureMultilabelACC"                  
[303] "measureMultilabelF1"                   
[304] "measureMultilabelHamloss"              
[305] "measureMultilabelPPV"                  
[306] "measureMultilabelSubset01"             
[307] "measureMultilabelTPR"                  
[308] "measureNPV"                            
[309] "measurePPV"                            
[310] "measureQSR"                            
[311] "measureRAE"                            
[312] "measureRMSE"                           
[313] "measureRMSLE"                          
[314] "measureRRSE"                           
[315] "measureRSQ"                            
[316] "measureSAE"                            
[317] "measureSpearmanRho"                    
[318] "measureSSE"                            
[319] "measureSSR"                            
[320] "measureTN"                             
[321] "measureTNR"                            
[322] "measureTP"                             
[323] "measureTPR"                            
[324] "measureWKAPPA"                         
[325] "medae"                                 
[326] "medse"                                 
[327] "mergeBenchmarkResults"                 
[328] "mergeSmallFactorLevels"                
[329] "mmce"                                  
[330] "mse"                                   
[331] "msle"                                  
[332] "multiclass.au1p"                       
[333] "multiclass.au1u"                       
[334] "multiclass.aunp"                       
[335] "multiclass.aunu"                       
[336] "multiclass.brier"                      
[337] "multilabel.acc"                        
[338] "multilabel.f1"                         
[339] "multilabel.hamloss"                    
[340] "multilabel.ppv"                        
[341] "multilabel.subset01"                   
[342] "multilabel.tpr"                        
[343] "normalizeFeatures"                     
[344] "npv"                                   
[345] "oversample"                            
[346] "performance"                           
[347] "plotBMRBoxplots"                       
[348] "plotBMRRanksAsBarChart"                
[349] "plotBMRSummary"                        
[350] "plotCalibration"                       
[351] "plotCritDifferences"                   
[352] "plotFilterValues"                      
[353] "plotHyperParsEffect"                   
[354] "plotLearnerPrediction"                 
[355] "plotLearningCurve"                     
[356] "plotPartialDependence"                 
[357] "plotResiduals"                         
[358] "plotROCCurves"                         
[359] "plotThreshVsPerf"                      
[360] "plotTuneMultiCritResult"               
[361] "ppv"                                   
[362] "predictLearner"                        
[363] "qsr"                                   
[364] "rae"                                   
[365] "reduceBatchmarkResults"                
[366] "reextractFDAFeatures"                  
[367] "reimpute"                              
[368] "removeConstantFeatures"                
[369] "removeHyperPars"                       
[370] "repcv"                                 
[371] "resample"                              
[372] "rmse"                                  
[373] "rmsle"                                 
[374] "rrse"                                  
[375] "rsq"                                   
[376] "sae"                                   
[377] "selectFeatures"                        
[378] "setAggregation"                        
[379] "setHyperPars"                          
[380] "setHyperPars2"                         
[381] "setId"                                 
[382] "setLearnerId"                          
[383] "setMeasurePars"                        
[384] "setPredictThreshold"                   
[385] "setPredictType"                        
[386] "setThreshold"                          
[387] "silhouette"                            
[388] "simplifyMeasureNames"                  
[389] "smote"                                 
[390] "spearmanrho"                           
[391] "sse"                                   
[392] "ssr"                                   
[393] "subsample"                             
[394] "subsetTask"                            
[395] "summarizeColumns"                      
[396] "summarizeLevels"                       
[397] "test.join"                             
[398] "test.max"                              
[399] "test.mean"                             
[400] "test.median"                           
[401] "test.min"                              
[402] "test.range"                            
[403] "test.rmse"                             
[404] "test.sd"                               
[405] "test.sum"                              
[406] "testgroup.mean"                        
[407] "testgroup.sd"                          
[408] "timeboth"                              
[409] "timepredict"                           
[410] "timetrain"                             
[411] "tn"                                    
[412] "tnr"                                   
[413] "tp"                                    
[414] "tpr"                                   
[415] "train"                                 
[416] "train.max"                             
[417] "train.mean"                            
[418] "train.median"                          
[419] "train.min"                             
[420] "train.range"                           
[421] "train.rmse"                            
[422] "train.sd"                              
[423] "train.sum"                             
[424] "trainLearner"                          
[425] "tuneParams"                            
[426] "tuneParamsMultiCrit"                   
[427] "tuneThreshold"                         
[428] "undersample"                           
[429] "wkappa"
#+end_example

* 参考

- ={mlr}=
  - [[https://mlr.mlr-org.com/][公式サイト]]
  - [[https://cloud.r-project.org/web/packages/mlr/index.html][CRAN]]
  - [[https://github.com/mlr-org/mlr/][Github repo]]
  - [[https://www.notion.so/mlr-Tutorial-b71444fe979c4a8cafe91e10e7f81d79][Tutorial]]
  - [[https://github.com/mlr-org/mlr/blob/master/addon/cheatsheet/MlrCheatsheet.pdf][Cheatsheet (PDF)]]
